# Taps
tap "derailed/k9s"

# CLI Tools
brew "chezmoi"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "gh"
brew "gradle"
brew "helm"
brew "kubectl"
brew "kubernetes-cli"
brew "kube-ps1"
brew "mise"
brew "node"
brew "oha"
brew "podman"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "redis"
brew "yarn"
brew "yq"
brew "derailed/k9s/k9s"

# Fonts
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "font-sf-mono-nerd-font-ligaturized"
brew "font-sf-mono"
brew "font-sf-mono-for-powerline"
brew "font-sf-pro"
brew "font-sf-compact"

# VSCode Extensions
vscode "agauniyal.vscode-caniuse"
vscode "apollographql.vscode-apollo"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "formulahendry.auto-close-tag"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gwardwell.darkwell"
vscode "hollowtree.vue-snippets"
vscode "jebbs.plantuml"
vscode "johnpapa.vscode-peacock"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leizongmin.node-module-intellisense"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "pmsandhu.webstorm-icons"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "qezhu.gitlink"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rhaiscript.vscode-rhai"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "searking.preview-vscode"
vscode "skyapps.fish-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.dingo-vscode"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wix.vscode-import-cost"
vscode "zignd.html-css-class-completion"

# Cask Apps
cask "1password"
cask "1password-cli"
cask "claude"
cask "clocker"
cask "cursor"
cask "cursor-cli"
cask "docker-desktop"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "raycast"
cask "typora"
cask "visual-studio-code"
cask "zoom"
